#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>
```
      terraform
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=6f530b1e255a48b91c3d82c7074260309419d719]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=1839318108314600526]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/github_webhook]
aws_api_gateway_rest_api.webhook: Refreshing state... [id=hhkylmc3t4]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=github_webhook]
module.lambda_function.aws_iam_role_policy_attachment.additional_one[0]: Refreshing state... [id=github_webhook-20211228143358455800000001]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=github_webhook]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::187662067789:policy/github_webhook-logs]
aws_api_gateway_resource.resource: Refreshing state... [id=bv28zw]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=github_webhook-20211228143358595500000002]
aws_api_gateway_method.method: Refreshing state... [id=agm-hhkylmc3t4-bv28zw-POST]
aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-hhkylmc3t4-bv28zw-POST-200]
module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGateway"]: Refreshing state... [id=APIGateway]
module.lambda_function.aws_lambda_permission.current_version_triggers["APIGateway"]: Refreshing state... [id=APIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-hhkylmc3t4-bv28zw-POST]
aws_api_gateway_integration_response.integration_response: Refreshing state... [id=agir-hhkylmc3t4-bv28zw-POST-200]
aws_api_gateway_deployment.deployment: Refreshing state... [id=8fnqut]
time_sleep.wait_10_seconds: Refreshing state... [id=2021-12-28T14:34:23Z]
aws_api_gateway_stage.github: Refreshing state... [id=ags-hhkylmc3t4-github]
github_organization_webhook.webhook: Refreshing state... [id=335510934]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lambda_function.local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "set:filter",
                      - [
                          - "service.py",
                          - "!pylambda/.*",
                          - "!dist/.*",
                          - "!event.*.json",
                          - "!requirements.*",
                          - "!config.yaml",
                          - "!.gitignore",
                          - "!__pycache__/.*",
                        ],
                    ],
                  - [
                      - "pip",
                      - "python3.8",
                      - "../webhook/requirements-runtime.txt",
                      - null,
                      - null,
                    ],
                  - [
                      - "zip",
                      - "../webhook",
                      - null,
                    ],
                  - [
                      - "clear:filter",
                    ],
                ]
              - filename      = "builds/9d3a472d9a8c4977c414167a94e0292449b2708086747f5ac0f755c3ed00c7f5.zip"
              - runtime       = "python3.8"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/9d3a472d9a8c4977c414167a94e0292449b2708086747f5ac0f755c3ed00c7f5.plan.json" -> null
      - id                   = "6f530b1e255a48b91c3d82c7074260309419d719" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2022-01-13T14:37:52Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-central-1:187662067789:hhkylmc3t4/" -> (known after apply)
      ~ id            = "8fnqut" -> (known after apply)
      ~ invoke_url    = "https://hhkylmc3t4.execute-api.eu-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "bff6cceafad20e380ba5d941ff021e49e050a977"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.github will be updated in-place
  ~ resource "aws_api_gateway_stage" "github" {
      ~ deployment_id         = "8fnqut" -> (known after apply)
        id                    = "ags-hhkylmc3t4-github"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/9d3a472d9a8c4977c414167a94e0292449b2708086747f5ac0f755c3ed00c7f5.zip" -> "builds/0efd7b18131dddec24ae63ff5da870df71d1080852b605c9d91b0230260a2a9d.zip"
        id                             = "github_webhook"
      ~ last_modified                  = "2022-01-13T14:37:42.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:187662067789:function:github_webhook:47" -> (known after apply)
        tags                           = {
            "Name" = "webhook"
        }
      ~ version                        = "47" -> (known after apply)
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
+/- resource "aws_lambda_permission" "current_version_triggers" {
      ~ id            = "APIGateway" -> (known after apply)
      ~ qualifier     = "47" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "set:filter",
                      + [
                          + "service.py",
                          + "!pylambda/.*",
                          + "!dist/.*",
                          + "!event.*.json",
                          + "!requirements.*",
                          + "!config.yaml",
                          + "!.gitignore",
                          + "!__pycache__/.*",
                        ],
                    ],
                  + [
                      + "pip",
                      + "python3.8",
                      + "../webhook/requirements-runtime.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "../webhook",
                      + null,
                    ],
                  + [
                      + "clear:filter",
                    ],
                ]
              + filename      = "builds/0efd7b18131dddec24ae63ff5da870df71d1080852b605c9d91b0230260a2a9d.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0efd7b18131dddec24ae63ff5da870df71d1080852b605c9d91b0230260a2a9d.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1839318108314600526" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9d3a472d9a8c4977c414167a94e0292449b2708086747f5ac0f755c3ed00c7f5.zip" -> "builds/0efd7b18131dddec24ae63ff5da870df71d1080852b605c9d91b0230260a2a9d.zip"
          ~ "timestamp" = "1642084651630778000" -> "1642085235762532000"
        }
    }

Plan: 4 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
      ```
</details>